Documents/УправлениеСоставомЖильцов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УправлениеСоставомЖильцов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СобственникиОбектовЛицевыхСчетов</xr:Item>
				<xr:Item>InformationRegister.СведенияОПрописанныхЖильцах</xr:Item>
				<xr:Item>InformationRegister.СведенияОПроживающихЖильцах</xr:Item>
				<xr:Item>InformationRegister.СтепеньРодстваФизическихЛиц</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Жильцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Жилец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Собственник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСобственности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияДействияПрописки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияПериодаПроживания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньРодства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыРодственныхСвязей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прописан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проживает</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаПроживания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОтветственныйВладелецЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныйВладелецЛицевогоСчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УправлениеСоставомЖильцов/Ext/ManagerModule.bsl
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуСведенияОПрописанныхЖильцах(ДокументСсылкаУправлениеСоставомЖильцов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаСоставЖильцов.ЛицевойСчет,
		|	ВременнаяТаблицаСоставЖильцов.Жилец,
		|	ВременнаяТаблицаСоставЖильцов.ДатаНачалаДействия КАК Период,
		|	ИСТИНА КАК Прописан
		|ИЗ
		|	ВременнаяТаблицаСоставЖильцов КАК ВременнаяТаблицаСоставЖильцов
		|ГДЕ
		|	ВременнаяТаблицаСоставЖильцов.ДатаНачалаДействия <> &ПустаяДата
		|	И ВременнаяТаблицаСоставЖильцов.Прописан = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаСоставЖильцов.ЛицевойСчет,
		|	ВременнаяТаблицаСоставЖильцов.Жилец,
		|	ВременнаяТаблицаСоставЖильцов.ДатаОкончанияДействияПрописки,
		|	ЛОЖЬ
		|ИЗ
		|	ВременнаяТаблицаСоставЖильцов КАК ВременнаяТаблицаСоставЖильцов
		|ГДЕ
		|	ВременнаяТаблицаСоставЖильцов.Прописан = ИСТИНА
		|	И ВременнаяТаблицаСоставЖильцов.ДатаОкончанияДействияПрописки <> &ПустаяДата";
	
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСведенияОПрописанныхЖильцах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуСведенияОПрописанныхПотребителяхУслуг()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуСведенияОПроживающихЖильцах(ДокументСсылкаУправлениеСоставомЖильцов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаСоставЖильцов.ЛицевойСчет,
		|	ВременнаяТаблицаСоставЖильцов.Жилец,
		|	ИСТИНА КАК Проживает,
		|	ВременнаяТаблицаСоставЖильцов.ДатаНачалаПроживания КАК Период
		|ИЗ
		|	ВременнаяТаблицаСоставЖильцов КАК ВременнаяТаблицаСоставЖильцов
		|ГДЕ
		|	ВременнаяТаблицаСоставЖильцов.Проживает = ИСТИНА
		|   И ВременнаяТаблицаСоставЖильцов.ДатаНачалаПроживания <> &ПустаяДата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаСоставЖильцов.ЛицевойСчет,
		|	ВременнаяТаблицаСоставЖильцов.Жилец,
		|	ЛОЖЬ,
		|	ВременнаяТаблицаСоставЖильцов.ДатаОкончанияПериодаПроживания
		|ИЗ
		|	ВременнаяТаблицаСоставЖильцов КАК ВременнаяТаблицаСоставЖильцов
		|ГДЕ
		|	ВременнаяТаблицаСоставЖильцов.Проживает = ИСТИНА
		|	И ВременнаяТаблицаСоставЖильцов.ДатаОкончанияПериодаПроживания <> &ПустаяДата";
	
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСведенияОПроживающихЖильцах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуСведенияОПроживающихПотребителяхУслуг()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуСтепеньРодстваФизическихЛиц(ДокументСсылкаУправлениеСоставомЖильцов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаСоставЖильцов.Период,
		|	ВременнаяТаблицаСоставЖильцов.ОтветственныйВладелецФизЛицо КАК ФизическоеЛицоОсновное,
		|	ВременнаяТаблицаСоставЖильцов.ПотребительУслугФизЛицо КАК ФизическоеЛицоСвязанное,
		|	ВременнаяТаблицаСоставЖильцов.СтепеньРодства
		|ИЗ
		|	ВременнаяТаблицаСоставЖильцов КАК ВременнаяТаблицаСоставЖильцов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСтепеньРодстваФизическихЛиц", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуСтепеньРодстваФизическихЛиц()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуСобственникиОбъектовЛицквыхСчетов(ДокументСсылкаУправлениеСоставомЖильцов, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	Запрос.Текст = "ВЫБРАТЬ
	|	ВременнаяТаблицаСоставЖильцов.Период,
	|	ВременнаяТаблицаСоставЖильцов.Жилец КАК Собственник,
	|	ВременнаяТаблицаСоставЖильцов.ЛицевойСчет КАК ЛицевойСчет,
	|	ВременнаяТаблицаСоставЖильцов.ДоляСобственности КАК Доля,
	|	ВременнаяТаблицаСоставЖильцов.ОбъектЛицевогоСчета
	|ИЗ
	|	ВременнаяТаблицаСоставЖильцов КАК ВременнаяТаблицаСоставЖильцов
	|ГДЕ
	|	ВременнаяТаблицаСоставЖильцов.Собственник = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСведенияОСобственниках", РезультатЗапроса.Выгрузить());
			   

КонецПроцедуры //СформироватьТаблицуСобственникиОбъектовЛицквыхСчетов()


// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(УправлениеСоставомЖильцов, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УправлениеСоставомЖильцовЖильцы.Жилец КАК Жилец,
		|	УправлениеСоставомЖильцовЖильцы.ДатаНачалаДействия,
		|	УправлениеСоставомЖильцовЖильцы.ДатаОкончанияДействияПрописки,
		|	УправлениеСоставомЖильцовЖильцы.СтепеньРодства,
		|	УправлениеСоставомЖильцовЖильцы.Прописан,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо КАК ОтветственныйВладелецФизЛицо,
		|	УправлениеСоставомЖильцовЖильцы.Ссылка.ЛицевойСчет,
		|	УправлениеСоставомЖильцовЖильцы.Жилец КАК ПотребительУслугФизЛицо,
		|	УправлениеСоставомЖильцовЖильцы.Ссылка.Дата КАК Период,
		|	УправлениеСоставомЖильцовЖильцы.Собственник,
		|	УправлениеСоставомЖильцовЖильцы.ДоляСобственности,
		|	УправлениеСоставомЖильцовЖильцы.Ссылка.ЛицевойСчет.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
		|	УправлениеСоставомЖильцовЖильцы.ДатаОкончанияПериодаПроживания,
		|	УправлениеСоставомЖильцовЖильцы.Проживает,
		|	УправлениеСоставомЖильцовЖильцы.ДатаНачалаПроживания
		|ПОМЕСТИТЬ ВременнаяТаблицаСоставЖильцов
		|ИЗ
		|	Документ.УправлениеСоставомЖильцов.Жильцы КАК УправлениеСоставомЖильцовЖильцы,
		|	РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|ГДЕ
		|	УправлениеСоставомЖильцовЖильцы.Ссылка = &Ссылка";	
	
	Запрос.УстановитьПараметр("Ссылка", УправлениеСоставомЖильцов);
	Запрос.УстановитьПараметр("ЛицевойСчет", УправлениеСоставомЖильцов.ЛицевойСчет);
	
	
	МассивРезультатов = Запрос.Выполнить();
	
	СформироватьТаблицуСведенияОПрописанныхЖильцах(УправлениеСоставомЖильцов, СтруктураДополнительныеСвойства);
	СформироватьТаблицуСведенияОПроживающихЖильцах(УправлениеСоставомЖильцов, СтруктураДополнительныеСвойства);
	СформироватьТаблицуСтепеньРодстваФизическихЛиц(УправлениеСоставомЖильцов, СтруктураДополнительныеСвойства);
	СформироватьТаблицуСобственникиОбъектовЛицквыхСчетов(УправлениеСоставомЖильцов, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Функция формирует печатную форму документа по указанному макету.
//
// Параметры:
//	ТабличныйДокумент - ТабличныйДокумент в который будет выводится печатная
//				   форма.
//  ИмяМакета    - Строка, имя макета печатной формы.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_УправлениеСоставомЖильцов";
	
	ПервыйДокумент = Истина;
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "ТалонПрибытия" Тогда
			
			КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
 				
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УправлениеСоставомЖильцов";
			
			Макет = УправлениеПечатью.ПолучитьМакет("Документ.УправлениеСоставомЖильцов.ПФ_MXL_ТалонПрибытия");
			
			Макет.КодЯзыкаМакета = КодЯзыкаПечать;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Тело");				
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		ИначеЕсли ИмяМакета = "ТалонУбытия" Тогда
			
			КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
 				
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УправлениеСоставомЖильцов";
			
			Макет = УправлениеПечатью.ПолучитьМакет("Документ.УправлениеСоставомЖильцов.ПФ_MXL_ТалонУбытия");
			
			Макет.КодЯзыкаМакета = КодЯзыкаПечать;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Тело");				
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		ИначеЕсли ИмяМакета = "ЗаявлениеОРегистрации" Тогда
			
			КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
 				
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УправлениеСоставомЖильцов";
			
			Макет = УправлениеПечатью.ПолучитьМакет("Документ.УправлениеСоставомЖильцов.ПФ_MXL_ЗаявлениеОРегистрации");
			
			Макет.КодЯзыкаМакета = КодЯзыкаПечать;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(ОбластьМакета);

			ОбластьМакета = Макет.ПолучитьОбласть("Тело");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		ИначеЕсли ИмяМакета = "ЗаявлениеОВыписке" Тогда
			
			КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
 				
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УправлениеСоставомЖильцов";
			
			Макет = УправлениеПечатью.ПолучитьМакет("Документ.УправлениеСоставомЖильцов.ПФ_MXL_ЗаявлениеОВыписке");
			
			Макет.КодЯзыкаМакета = КодЯзыкаПечать;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Тело");
			ТабличныйДокумент.Вывести(ОбластьМакета);
	
		ИначеЕсли ИмяМакета = "СправкаОСоставеСемьи" Тогда
			
			КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
 				
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УправлениеСоставомЖильцов";
			
			Макет = УправлениеПечатью.ПолучитьМакет("Справочник.ЛицевыеСчета.МакетСправкиПрописанных");
			
			Макет.КодЯзыкаМакета = КодЯзыкаПечать;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			Сч = 0;
			
			Пока Сч < 8 Цикл
			
				ОбластьМакета = Макет.ПолучитьОбласть("ТелоТаблицы");
				ТабличныйДокумент.Вывести(ОбластьМакета);
	            Сч=Сч+1;
				
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы2");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Сч = 0;
			
			Пока Сч < 3 Цикл
			
				ОбластьМакета = Макет.ПолучитьОбласть("ТелоТаблицы2");
				ТабличныйДокумент.Вывести(ОбластьМакета);
	            Сч=Сч+1;
				
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ТабличныйДокумент.Вывести(ОбластьМакета);
	
		ИначеЕсли ИмяМакета = "ФормаА1" Тогда
			
			КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
 				
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УправлениеСоставомЖильцов";
			
			Макет = УправлениеПечатью.ПолучитьМакет("Справочник.ЛицевыеСчета.МакетКарточкиПрописки");
			
			Макет.КодЯзыкаМакета = КодЯзыкаПечать;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("Рождение");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("Прибытие");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("ПаспортШапка");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			Сч = 0;
			
			Пока Сч < 3 Цикл
			
				ОбластьМакета = Макет.ПолучитьОбласть("ПаспортТело");
				ТабличныйДокумент.Вывести(ОбластьМакета);
	            Сч=Сч+1;
				
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Местонахождение");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("Работа");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("Дети");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("Армия");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("Прописка");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		ИначеЕсли ИмяМакета = "СправкаОПрописке" Тогда
			
			КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
 				
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УправлениеСоставомЖильцов";
			
			Макет = УправлениеПечатью.ПолучитьМакет("Справочник.ЛицевыеСчета.ПФ_MXL_СправкаОПрописке");
			
			Макет.КодЯзыкаМакета = КодЯзыкаПечать;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			Сч = 0;
			
			Пока Сч < 8 Цикл
			
				ОбластьМакета = Макет.ПолучитьОбласть("ТелоТаблицы");
				ТабличныйДокумент.Вывести(ОбластьМакета);
	            Сч=Сч+1;
				
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЕсли;

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати,);
		
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов,
				 ПараметрыПечати,
				 КоллекцияПечатныхФорм,
				 ОбъектыПечати,
				 ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТалонПрибытия") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТалонПрибытия", "Талон прибытия", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ТалонПрибытия"));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТалонУбытия") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТалонУбытия", "Талон убытия", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ТалонУбытия"));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявлениеОРегистрации") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЗаявлениеОРегистрации", "Заявление о регистрации", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЗаявлениеОРегистрации"));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявлениеОВыписке") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЗаявлениеОВыписке", "Заявление о снятии с регистрации", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЗаявлениеОВыписке"));	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СправкаОСоставеСемьи") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СправкаОСоставеСемьи", "Справка о составе семьи и прописке", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "СправкаОСоставеСемьи"));	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ФормаА1") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ФормаА1", "Форма А1", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ФормаА1"));	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СправкаОПрописке") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СправкаОПрописке", "Справка о прописке", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "СправкаОПрописке"));	
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьДанныеПечати(знач МассивДокументов, знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	ОписаниеОбластей = Новый Соответствие;
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	
	Возврат Новый Структура("Данные, Макеты",
							ДанныеПоВсемОбъектам,
							Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
											ОписаниеОбластей,
											ТипыМакетов,
											ДвоичныеДанныеМакетов));
	
КонецФункции
